Revit 2024 API
StairsRun Class
 Represents a stairs run element in Autodesk Revit.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class StairsRun : Element
Visual Basic
Public Class StairsRun _
	Inherits Element
Visual C++
public ref class StairsRun : public Element
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Architecture.StairsRun
See Also
StairsRun Members
Autodesk.Revit.DB.Architecture Namespace